[network]
batch=1
height=32
width=32
channels=3
learning_rate=0.4
policy=poly
momentum=0.9
decay=0.0005
max_batches = 5000

[convolutional]
filters=32
size=3
stride=1
activation=leaky

[maxpool]
stride=2

[convolutional]
filters=64
size=3
stride=1
activation=leaky

[maxpool]
stride=2

[convolutional]
filters=1
size=1
stride=1
activation=leaky

[avgpool]

[softmax]

[cost]
type=sse
scale=1
