[network]
batch=1
height=32
width=32
channels=3
max_batches = 300000

learning_rate=0.1
steps=5000,50000
scales=.1,.1

policy=steps
momentum=0.9
decay=0.0005

[convolutional]
filters=16
size=3
stride=1
activation=leaky

[maxpool]
stride=2

[convolutional]
filters=32
size=3
stride=1
activation=leaky

[maxpool]
stride=2

[convolutional]
filters=64
size=3
stride=1
activation=leaky

[maxpool]
stride=2

[convolutional]
filters=32
size=3
stride=1
activation=leaky

[maxpool]
stride=2

[convolutional]
filters=16
size=3
stride=1
activation=leaky

[maxpool]
stride=2

[convolutional]
filters=2
size=1
stride=1
activation=leaky

[avgpool]

[softmax]

[cost]
type=sse
scale=1
