[network]
batch=5
height=112
width=112
#width=96
channels=3
max_batches=30000

learning_rate=0.1
#policy=poly
#learning_rate_poly_power=4
policy=steps
steps=15000,21000,24000
scales=.1,.1,.1

momentum=0.9
decay=0.0005

#saturation = 1.02
#exposure = 1.05
#hue=.02

flip=1
mean_value=127.5
scale=0.0078125

# get 512 dimension feature
output_layer = 208
classes = 5000
#classes = 100
accuracy_count_max=8000

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

#stage 1 unit 1
[batchnorm]

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=64
size=3
stride=2
pad=1
weight_filler=xavier
activation=linear

[route]
layers=-4

[convolutional]
batch_normalize=1
filters=64
size=1
stride=2
pad=0
weight_filler=xavier
activation=linear

[shortcut]
from=-3

#stage 1 unit 2
[batchnorm]

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

[shortcut]
from=-4

#stage 1 unit 3
[batchnorm]

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

[shortcut]
from=-4

#stage 2 unit 1
[batchnorm]

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=128
size=3
stride=2
pad=1
weight_filler=xavier
activation=linear

[route]
layers=-4

[convolutional]
batch_normalize=1
filters=128
size=1
stride=2
pad=0
weight_filler=xavier
activation=linear

# _plus 3
[shortcut]
from=-3

#stage 2 unit 2
[batchnorm]

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

# _plus 4
[shortcut]
from=-4

#stage 2 unit 3
[batchnorm]

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

# _plus 5
[shortcut]
from=-4

#stage 2 unit 4
[batchnorm]

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

# _plus 6
[shortcut]
from=-4

#stage 2 unit 5
[batchnorm]

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

# _plus 7
[shortcut]
from=-4

#stage 2 unit 6
[batchnorm]

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

# _plus 8
[shortcut]
from=-4

#stage 2 unit 7
[batchnorm]

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

# _plus 9
[shortcut]
from=-4

#stage 2 unit 8
[batchnorm]

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

# _plus 10
[shortcut]
from=-4

#stage 2 unit 9
[batchnorm]

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

# _plus 11
[shortcut]
from=-4

#stage 2 unit 10
[batchnorm]

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

# _plus 12
[shortcut]
from=-4

#stage 2 unit 11
[batchnorm]

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

# _plus 13
[shortcut]
from=-4

#stage 2 unit 12
[batchnorm]

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

# _plus 14
[shortcut]
from=-4

#stage 2 unit 13
[batchnorm]

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

# _plus 15
[shortcut]
from=-4

#stage 3 unit 1
[batchnorm]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=2
pad=1
weight_filler=xavier
activation=linear

[route]
layers=-4

[convolutional]
batch_normalize=1
filters=256
size=1
stride=2
pad=0
weight_filler=xavier
activation=linear

# _plus 16
[shortcut]
from=-3

#stage 3 unit 2
[batchnorm]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

# _plus 17
[shortcut]
from=-4

#stage 3 unit 3
[batchnorm]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

# _plus 18
[shortcut]
from=-4

#stage 3 unit 4
[batchnorm]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

# _plus 19
[shortcut]
from=-4

#stage 3 unit 5
[batchnorm]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

# _plus 20
[shortcut]
from=-4

#stage 3 unit 6
[batchnorm]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

# _plus21
[shortcut]
from=-4

#stage 3 unit 7
[batchnorm]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

# _plus22
[shortcut]
from=-4

#stage 3 unit 8
[batchnorm]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

# _plus23
[shortcut]
from=-4

#stage 3 unit 9
[batchnorm]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

# _plus 24
[shortcut]
from=-4

#stage 3 unit 10
[batchnorm]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

# _plus 25
[shortcut]
from=-4

#stage 3 unit 11
[batchnorm]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

# _plus26
[shortcut]
from=-4

#stage 3 unit 12
[batchnorm]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

# _plus27
[shortcut]
from=-4

#stage 3 unit 13
[batchnorm]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

#_plus28
[shortcut]
from=-4

#stage 3 unit 14
[batchnorm]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

#_plus29
[shortcut]
from=-4

#stage 3 unit 15
[batchnorm]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

#_plus30
[shortcut]
from=-4

#stage 3 unit 16
[batchnorm]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

#_plus31
[shortcut]
from=-4

#stage 3 unit 17
[batchnorm]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

#_plus32
[shortcut]
from=-4

#stage 3 unit 18
[batchnorm]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

#_plus33
[shortcut]
from=-4

#stage 3 unit 19
[batchnorm]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

#_plus34
[shortcut]
from=-4

#stage 3 unit 20
[batchnorm]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

#_plus35
[shortcut]
from=-4

#stage 3 unit 21
[batchnorm]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

#_plus36
[shortcut]
from=-4

#stage 3 unit 22
[batchnorm]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

#_plus37
[shortcut]
from=-4

#stage 3 unit 23
[batchnorm]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

#_plus38
[shortcut]
from=-4

#stage 3 unit 24
[batchnorm]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

#_plus39
[shortcut]
from=-4

#stage 3 unit 25
[batchnorm]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

#_plus40
[shortcut]
from=-4

#stage 3 unit 26
[batchnorm]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

#_plus41
[shortcut]
from=-4

#stage 3 unit 27
[batchnorm]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

#_plus42
[shortcut]
from=-4

#stage 3 unit 28
[batchnorm]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

#_plus43
[shortcut]
from=-4

#stage 3 unit 29
[batchnorm]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

#_plus44
[shortcut]
from=-4

#stage 3 unit 30
[batchnorm]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

#_plus45
[shortcut]
from=-4

#stage4 unit 1
[batchnorm]

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=512
size=3
stride=2
pad=1
weight_filler=xavier
activation=linear

[route]
layers=-4

[convolutional]
batch_normalize=1
filters=512
size=1
stride=2
pad=0
weight_filler=xavier
activation=linear

#_plus46
[shortcut]
from=-3

#stage 4 unit 2
[batchnorm]

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

#_plus47
[shortcut]
from=-4

#stage 4 unit 3
[batchnorm]

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
weight_filler=xavier
activation=prelu

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
weight_filler=xavier
activation=linear

#_plus48
[shortcut]
from=-4

[batchnorm]

[dropout]
probability=.4

[connected]
batch_normalize=0
output = 512
weight_filler=xavier
activation=linear

[batchnorm]

[normalize]

##########################

[connected]
#output = 100
output = 5000
lr_mult=1
lr_decay_mult=0
bias_mult=0
bias_decay_mult=0

weight_filler=xavier
weight_normalize=1
bias_term=0
activation=linear

[softmax]
label_specific_margin_bias=-0.35
margin_scale=64
