[network]
batch=1
height=32
width=32
channels=3
max_batches = 3000

learning_rate=0.01
steps=400,1000
scales=.1,.1

policy=steps
momentum=0.9
decay=0.0005

[convolutional]
filters=6
size=5
stride=1
activation=ramp

[maxpool]
stride=2

[convolutional]
filters=16
size=5
stride=1
activation=ramp

[maxpool]
stride=2

[convolutional]
filters=120
size=3
stride=1
activation=ramp

[maxpool]
stride=2

[connected]
output = 80
activation=ramp

[connected]
output = 10
activation=ramp

[softmax]

[cost]
type=sse
scale=1
