[network]
batch=1
height=28
width=28
channels=1
max_batches = 3000

learning_rate=0.001
steps=5000,50000
scales=.1,.1

policy=steps
momentum=0.9
decay=0.001

[convolutional]
filters=6
size=5
stride=1
activation=ramp

[maxpool]
stride=2

[convolutional]
filters=16
size=5
stride=1
activation=ramp

[maxpool]
stride=2

[convolutional]
filters=120
size=3
stride=1
activation=ramp

[maxpool]
stride=2

[connected]
output = 80
activation=ramp

[connected]
output = 10
activation=ramp

[softmax]

[cost]
type=sse
scale=1
